{"pageProps":{"postData":{"id":"launch-portfolio-site","contentHtml":"<h2>How I launched my portfolio site with Google Domains and Netlify</h2>\n<hr>\n<p>Hello Everyone, A little while ago I knew I wanted to create my website. I looked at a bunch of different tech options and tried to figure out which one would be best. I knew Next.js and Gatsby were popular choices so I mainly researched those. After Bootcamp, I did make a full React-based portfolio but it was very large and slow on load time. I knew I could research how to improve this but I thought I would change the pace and try something new. I was reading about how server-side rendering would be better for load time. I chose Next over Gatsby just because I thought it was a tad bit newer and I enjoyed the tutorials while I was going through them. So I converted the React-based project into a Next.js project and now I am using that going forward.</p>\n<p>When I started to research domains and where to purchase them. I checked GoDaddy first (just because I'm 30 and I've always seen and heard their name) I also stumbled into Google Domains which I quickly leaned towards as the price was even with the range I was seeing and I wanted to have something from a brand I knew. I also came across sites such as  A2, Bluehost, Netlify, or Namecheap. I honestly have no advice as I'm sure if you have made it this far the process is decently simple with any provider you chose. In the end, the final check-out price was $12 for 1 year that I set to reoccurring. There was also an option on there to have a \"work\" email address. For example, you can choose info@jakearmijo.com or something along those lines. This was added for Google Workspace and was $6 per user per month and came with 30GB of cloud storage. I thought about it for our family pictures cause my wife has been searching for a cloud option to store all of our pictures on. If anyone has any good experiences with any cloud-based photo storage such as google photos or amazon photos or anything please DM on LinkedIn</p>\n<h3>Google Domains</h3>\n<p>Congrats! Your domain is set up - it may take more time but mine was ready within minuets. http://www.jakearmijo.com was born.</p>\n<p>Netlify will also set up the HTTPS certificate via https://letsencrypt.org/donate/. This process took a little longer but when I awoke in the morning I had the HTTPS before the URL and my site was not receiving the privacy warning.</p>\n<p>Cheers,</p>\n<p>Jake Armijo | Full Stack Software Engineer\nArmijojake@yahoo.com\nConnect with me on LinkedIn\nSchedule a meeting with me on Calendly</p>\n","title":"How I launched my portfolio site with Google Domains and Netlify","date":"2021-05-16","category":"Tutorial","template":"blog-post","tags":"Google Domains, Netlify, Nextjs, Gatsby, DNS, Portfolio Site"}},"__N_SSG":true}